pl-sql/4-2.tex
% Created 2023-11-10 Fri 22:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Agustín Alejandro Mota Hinojosa}
\date{\today}
\title{4-2: Conditional Control: Case Statements PL/SQL 4-2: Conditional Control: Case Statements}
\hypersetup{
 pdfauthor={Agustín Alejandro Mota Hinojosa},
 pdftitle={4-2: Conditional Control: Case Statements PL/SQL 4-2: Conditional Control: Case Statements},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Vocabulary}
\label{sec:orgbc7f163}

An expression that selects a result and returns it into a variable.

\textbf{CASE expression}

Shows the results of all possible combinations of two conditions.

\textbf{Logic Tables}

A block of code that performs actions based on conditional tests.

\textbf{CASE statement}
\section{Try It / Solve It}
\label{sec:orgedcbdae}

\textbf{1.A}

\begin{verbatim}
DECLARE
 v_country_name wf_countries.country_name%TYPE := 'Japan';
 v_airports wf_countries.airports%TYPE;
 v_string VARCHAR2(60);
BEGIN
 SELECT airports INTO v_airports
 FROM wf_countries
 WHERE country_name = v_country_name;
 v_string :=
 CASE
 WHEN v_airports < 101 THEN 'There are 100 or fewer airports.'
 WHEN v_airports < 1001 THEN 'There are between 101 and 1,000 airports'
 WHEN v_airports < 10001 THEN 'There are between 1,001 and 10,000 airports'
 WHEN v_airports > 10000 THEN 'There are more than 10,000 airports.'
 ELSE 'The number of airports is not available for this country.'
 END;
 DBMS_OUTPUT.PUT_LINE(v_string);
END;
\end{verbatim}

\textbf{1.B}

\begin{itemize}
\item Japan: There are more than 10,000 airports.
\item Malaysia: There are between 1,001 and 10,000 airports.
\item Mongolia: There are more than 10,000 airports.
\item Navassa Island: The number of airports is not available for this country.
\item Romania: There are between 1,001 and 10,000 airports.
\item United States of America: There are more than 10,000 airports.
\end{itemize}

\textbf{2.A}

\begin{verbatim}
DECLARE
 v_country_name wf_countries.country_name%TYPE := 'Grenada';
 v_coastline wf_countries.coastline %TYPE;
 v_coastline_description VARCHAR2(50);
BEGIN
 SELECT coastline INTO v_coastline
 FROM wf_countries
 WHERE country_name = v_country_name;
 v_coastline_description :=
 CASE
 WHEN v_coastline = 0 THEN 'no coastline'
 WHEN v_coastline < 1000 THEN 'a small coastline'
 WHEN v_coastline < 10000 THEN 'a mid-range coastline'
 ELSE 'a large coastline'
 END;
 DBMS_OUTPUT.PUT_LINE('Country ' || v_country_name || ' has ' || v_coastline_description);
END;
\end{verbatim}

\textbf{2.B}

\begin{itemize}
\item Grenada: a small coastline
\item Jamaica: a large coastline
\item Japan: a large coastline
\item Mongolia: a large coastline
\item Ukraine: a large coastline
\end{itemize}

\textbf{3.A}

\begin{verbatim}
DECLARE
 v_currency wf_countries.currency_code%TYPE := 'CHF';
 v_result VARCHAR2(50);
 v_count NUMBER(3);
BEGIN
 SELECT count(country_id) INTO v_count
 FROM wf_countries
 WHERE currency_code = v_currency;
 v_result :=
 CASE
 WHEN v_count < 10 THEN 'Fewer than 10 countries'
 WHEN v_count < 21 THEN 'Between 10 and 20 countries'
 ELSE 'More than 20 countries'
 END;
 DBMS_OUTPUT.PUT_LINE(v_result);
END;
\end{verbatim}

\textbf{3.B}

\begin{itemize}
\item CHF (Swiss franc): Fewer than 10 countries
\item EUR (Euro): Fewer than 10 countries
\end{itemize}

\textbf{4.A}

\begin{verbatim}
DECLARE
 x BOOLEAN := FALSE;
 y BOOLEAN;
 v_color VARCHAR(20) := 'Red';
BEGIN
 IF (x OR y)
 THEN v_color := 'White';
 ELSE
 v_color := 'Black';
 END IF;
 DBMS_OUTPUT.PUT_LINE(v_color);
END;
\end{verbatim}

Output: Black

\textbf{4.B}
\begin{verbatim}
DECLARE
 x BOOLEAN ;
 y BOOLEAN ;
 v_color VARCHAR(20) := 'Red';
BEGIN
 IF (x OR y)
 THEN v_color := 'White';
 ELSE
 v_color := 'Black';
 END IF;
 DBMS_OUTPUT.PUT_LINE(v_color);
END;
\end{verbatim}

Output: Black

\textbf{4.C}
\begin{verbatim}
DECLARE
 x BOOLEAN := TRUE;
 y BOOLEAN := TRUE;
 v_color VARCHAR(20) := 'Red';
BEGIN
 IF (x OR y)
 THEN v_color := 'White';
 ELSE
 v_color := 'Black';
 END IF;
 DBMS_OUTPUT.PUT_LINE(v_color);
END;
\end{verbatim}

Output: White

\textbf{4.D}

\begin{verbatim}
DECLARE
 x BOOLEAN := FALSE;
 y BOOLEAN := FALSE;
 v_color VARCHAR(20) := 'Red';
BEGIN
 IF (x AND y)
 THEN v_color := 'White';
 ELSE
 v_color := 'Black';
 END IF;
 DBMS_OUTPUT.PUT_LINE(v_color);
END;
\end{verbatim}

Output: Black
\end{document}